{"_meta": {
		"sources": [
			{
				"json": "Fateforge: Adventurers Corebook",
				"abbreviation": "FFA",
				"full": "Fateforge: Adventurers Corebook",
				"authors": [
					"Studio Agate"
				],
				"convertedBy": [
					"Nivrelin#1337"
				],
				"url": "https://raw.githubusercontent.com/Nivrelin/FFA/main/FFA_Barbarian.json",
				"version": "initial",
				"color": "867d5a"
			}
		],
		"dateAdded": 1595181963,
		"dateLastModified": 1655302828,
		"_dateLastModifiedHash": "0539b074a4"
	},
  "class": [
    {
      "name": "Barbarian",
      "source": "FFA",
      "page": 120,
      "hd": {
        "number": 1,
        "faces": 12
      },
      "proficiency": [
        "str",
        "con"
      ],
      "startingProficiencies": {
        "armor": [
          "light",
          "medium",
          "{@item shield|phb|shields}"
        ],
        "weapons": [
          "simple",
          "martial"
        ],
        "skills": [
          {
            "choose": {
              "from": [
                "animal handling",
                "athletics",
                "insight",
                "intimidation",
                "perception",
                "survival"
              ],
              "count": 2
            }
          }
        ]
      },
      "startingEquipment": {
        "additionalFromBackground": true,
        "default": [
          "(a) a {@item greataxe|phb} or (b) any {@filter martial melee weapon|items|source=phb|category=basic|type=martial weapon;melee weapon=sand}",
          "(a) two {@item handaxe|phb|handaxes} or (b) any {@filter simple weapon|items|source=phb|category=basic|type=simple weapon}",
          "(a) four {@item javelin|phb|javelins} or (b) a {@item blowgun|phb} and 10 {@item dart|phb|darts} or (c) a {@item shortbow|phb} and a quiver of 20 {@item arrow|phb|arrows}",
          "An {@item explorer's pack|phb}"
        ],
        "goldAlternative": "{@dice 2d4 × 10|2d4 × 10|Starting Gold}",
        "defaultData": [
          {
            "a": [
              "greataxe|phb"
            ],
            "b": [
              {
                "equipmentType": "weaponMartialMelee"
              }
            ]
          },
          {
            "a": [
              {
                "item": "handaxe|phb",
                "quantity": 2
              }
            ],
            "b": [
              {
                "equipmentType": "weaponSimple"
              }
            ]
          },
          {
            "a": [
              {
                "item": "javelin|phb",
                "quantity": 4
              }
            ],
            "b": [
              "blowgun|phb",
              {
                "item": "dart|phb",
                "quantity": 10
              }
            ],
            "c": [
              "shortbow|phb",
              {
                "item": "arrow|phb",
                "quantity": 20
              }
            ]
          },
          {
            "_": [
              "explorer's pack|phb"
            ]
          }
        ]
      },
      "multiclassing": {
        "requirements": {
          "str": 13
        },
        "proficienciesGained": {
          "armor": [
            "{@item shield|phb|shields}"
          ],
          "weapons": [
            "simple",
            "martial"
          ]
        }
      },
      "classTableGroups": [
        {
          "colLabels": [
            "Rages",
            "Rage Damage"
          ],
          "rows": [
            [
              "2",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "2",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "3",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "3",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "3",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 2
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "4",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "5",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "5",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "5",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "5",
              {
                "type": "bonus",
                "value": 3
              }
            ],
            [
              "5",
              {
                "type": "bonus",
                "value": 4
              }
            ],
            [
              "6",
              {
                "type": "bonus",
                "value": 4
              }
            ],
            [
              "6",
              {
                "type": "bonus",
                "value": 4
              }
            ],
            [
              "6",
              {
                "type": "bonus",
                "value": 4
              }
            ],
            [
              "Unlimited",
              {
                "type": "bonus",
                "value": 4
              }
            ]
          ]
        }
      ],
      "classFeatures": [
        "Rage|Barbarian||1",
        "Unarmored Defense|Barbarian||1",
        "Danger Sense|Barbarian||2",
        "Reckless Attack|Barbarian||2",
        {
          "classFeature": "Primal Path|Barbarian||3",
          "gainSubclassFeature": true
        },
        "Primal Knowledge|Barbarian||3|TCE",
        "Ability Score Improvement|Barbarian||4",
        "Extra Attack|Barbarian||5",
        "Fast Movement|Barbarian||5",
        {
          "classFeature": "Path Feature|Barbarian||6",
          "gainSubclassFeature": true
        },
        "Feral Instinct|Barbarian||7",
        "Instinctive Pounce|Barbarian||7|TCE",
        "Ability Score Improvement|Barbarian||8",
        "Brutal Critical (1 die)|Barbarian||9",
        {
          "classFeature": "Path feature|Barbarian||10",
          "gainSubclassFeature": true
        },
        "Relentless Rage|Barbarian||11",
        "Ability Score Improvement|Barbarian||12",
        "Brutal Critical (2 dice)|Barbarian||13",
        {
          "classFeature": "Path feature|Barbarian||14",
          "gainSubclassFeature": true
        },
        "Persistent Rage|Barbarian||15",
        "Ability Score Improvement|Barbarian||16",
        "Brutal Critical (3 dice)|Barbarian||17",
        "Indomitable Might|Barbarian||18",
        "Ability Score Improvement|Barbarian||19",
        "Primal Champion|Barbarian||20"
      ],
      "subclassTitle": "Primal Path",
      "fluff": [
        {
          "name": "Barbarian",
          "type": "section",
          "entries": [
            "A tall human tribesman strides through a blizzard, draped in fur and hefting his axe. He laughs as he charges toward the frost giant who dared poach his people's elk herd.",
            "A half-orc snarls at the latest challenger to her authority over their savage tribe, ready to break his neck with her bare hands as she did to the last six rivals.",
            "Frothing at the mouth, a dwarf slams his helmet into the face of his drow foe, then turns to drive his armored elbow into the gut of another.",
            "These barbarians, different as they might be, are defined by their rage: unbridled, unquenchable, and unthinking fury. More than a mere emotion, their anger is the ferocity of a cornered predator, the unrelenting assault of a storm, the churning turmoil of the sea.",
            "For some, their rage springs from a communion with fierce animal spirits. Others draw from a roiling reservoir of anger at a world full of pain. For every barbarian, rage is a power that fuels not just a battle frenzy but also uncanny reflexes, resilience, and feats of strength.",
            {
              "type": "entries",
              "name": "Primal Instinct",
              "entries": [
                "People of towns and cities take pride in how their civilized ways set them apart from animals, as if denying one's own nature was a mark of superiority. To a barbarian, though, civilization is no virtue, but a sign of weakness. The strong embrace their animal nature—keen instincts, primal physicality, and ferocious rage. Barbarians are uncomfortable when hedged in by walls and crowds. They thrive in the wilds of their homelands: the tundra, jungle, or grasslands where their tribes live and hunt.",
                "Barbarians come alive in the chaos of combat. They can enter a berserk state where rage takes over, giving them superhuman strength and resilience. A barbarian can draw on this reservoir of fury only a few times without resting, but those few rages are usually sufficient to defeat whatever threats arise."
              ]
            },
            {
              "type": "entries",
              "name": "A Life of Danger",
              "entries": [
                "Not every member of the tribes deemed \"barbarians\" by scions of civilized society has the barbarian class. A true barbarian among these people is as uncommon as a skilled fighter in a town, and he or she plays a similar role as a protector of the people and a leader in times of war. Life in the wild places of the world is fraught with peril: rival tribes, deadly weather, and terrifying monsters. Barbarians charge headlong into that danger so that their people don't have to.",
                "Their courage in the face of danger makes barbarians perfectly suited for adventuring. Wandering is often a way of life for their native tribes, and the rootless life of the adventurer is little hardship for a barbarian. Some barbarians miss the close-knit family structures of the tribe, but eventually find them replaced by the bonds formed among the members of their adventuring parties."
              ]
            },
            {
              "type": "entries",
              "name": "Creating a Barbarian",
              "entries": [
                "When creating a barbarian character, think about where your character comes from and his or her place in the world. Talk with your DM about an appropriate origin for your barbarian. Did you come from a distant land, making you a stranger in the area of the campaign? Or is the campaign set in a rough-and-tumble frontier where barbarians are common?",
                "What led you to take up the adventuring life? Were you lured to settled lands by the promise of riches? Did you join forces with soldiers of those lands to face a shared threat? Did monsters or an invading horde drive you out of your homeland, making you a rootless refugee? Perhaps you were a prisoner of war, brought in chains to \"civilized\" lands and only now able to win your freedom. Or you might have been cast out from your people because of a crime you committed, a taboo you violated, or a coup that removed you from a position of authority.",
                {
                  "type": "entries",
                  "name": "Quick Build",
                  "entries": [
                    "You can make a barbarian quickly by following these suggestions. First, put your highest ability score in Strength, followed by Constitution. Second, choose the {@background outlander} background."
                  ]
                }
              ]
            }
          ],
          "source": "PHB",
          "page": 46
        },
        {
          "type": "section",
          "entries": [
            {
              "type": "quote",
              "entries": [
                "I have witnessed the indomitable performance of barbarians on the field of battle, and it makes me wonder what force lies at the heart of their rage."
              ],
              "by": "Seret, archwizard"
            },
            "The anger felt by a normal person resembles the rage of a barbarian in the same way that a gentle breeze is akin to a furious thunderstorm. The barbarian's driving force comes from a place that transcends mere emotion, making its manifestation all the more terrible. Whether the impetus for the fury comes entirely from within or from forging a link with a spirit animal, a raging barbarian becomes able to perform supernatural feats of strength and endurance. The outburst is temporary, but while it lasts, it takes over body and mind, driving the barbarian on despite peril and injury, until the last enemy falls.",
            "It can be tempting to play a barbarian character that is a straightforward application of the classic archetype—a brute, and usually a dimwitted one at that, who rushes in where others fear to tread. But not all the barbarians in the world are cut from that cloth, so you can certainly put your own spin on things. Either way, consider adding some flourishes to make your barbarian stand out from all others; see the following sections for some ideas.",
            {
              "type": "entries",
              "name": "Personal Totems",
              "entries": [
                "Barbarians tend to travel light, carrying little in the way of personal effects or other unnecessary gear. The few possessions they do carry often include small items that have special significance. A personal totem is significant because it has a mystical origin or is tied to an important moment in the character's life—perhaps a remembrance from the barbarian's past or a harbinger of what lies ahead.",
                "A personal totem of this sort might be associated with a barbarian's spirit animal, or might actually be the totem object for the animal, but such a connection is not essential. One who has a bear totem spirit, for instance, could still carry an eagle's feather as a personal totem.",
                "Consider creating one or more personal totems for your character—objects that hold a special link to your character's past or future. Think about how a totem might affect your character's actions.",
                {
                  "type": "table",
                  "caption": "Personal Totems",
                  "colLabels": [
                    "{@dice d6}",
                    "Totem"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "A tuft of fur from a solitary wolf that you befriended during a hunt"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Three eagle feathers given to you by a wise shaman, who told you they would play a role in determining your fate"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "A necklace made from the claws of a young cave bear that you slew singlehandedly as a child"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "A small leather pouch holding three stones that represent your ancestors"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "A few small bones from the first beast you killed, tied together with colored wool"
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "An egg-sized stone in the shape of your spirit animal that appeared one day in your belt pouch"
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Tattoos",
              "entries": [
                "The members of many barbarian clans decorate their bodies with tattoos, each of which represents a significant moment in the life of the bearer or the bearer's ancestors, or which symbolizes a feeling or an attitude. As with personal totems, a barbarian's tattoos might or might not be related to an animal spirit.",
                "Each tattoo a barbarian displays contributes to that individual's identity. If your character wears tattoos, what do they look like, and what do they represent?",
                {
                  "type": "table",
                  "caption": "Tattoos",
                  "colLabels": [
                    "{@dice d6}",
                    "Tattoo"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "The wings of an eagle are spread wide across your upper back."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Etched on the backs of your hands are the paws of a cave bear."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "The symbols of your clan are displayed in viny patterns along your arms."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "The antlers of an elk are inked across your back."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "Images of your spirit animal are tattooed along your weapon arm and hand."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "The eyes of a wolf are marked on your back to help you see and ward off evil spirits."
                    ]
                  ]
                }
              ]
            },
            {
              "type": "entries",
              "name": "Superstitions",
              "entries": [
                "Barbarians vary widely in how they understand life. Some follow gods and look for guidance from those deities in the cycles of nature and the animals they encounter. These barbarians believe that spirits inhabit the plants and animals of the world, and the barbarians look to them for omens and power.",
                "Other barbarians trust only in the blood that runs in their veins and the steel they hold in their hands. They have no use for the invisible world, instead relying on their senses to hunt and survive like the wild beasts they emulate.",
                "Both of these attitudes can give rise to superstitions. These beliefs are often passed down within a family or shared among the members of a clan or a hunting group.",
                "If your barbarian character has any superstitions, were they ingrained in you by your family, or are they the result of personal experience?",
                {
                  "type": "table",
                  "caption": "Superstition",
                  "colLabels": [
                    "{@dice d6}",
                    "Superstition"
                  ],
                  "colStyles": [
                    "col-1 text-center",
                    "col-11"
                  ],
                  "rows": [
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 1
                        }
                      },
                      "If you disturb the bones of the dead, you inherit all the troubles that plagued them in life."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 2
                        }
                      },
                      "Never trust a wizard. They're all devils in disguise, especially the friendly ones."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 3
                        }
                      },
                      "Dwarves have lost their spirits, and are almost like the undead. That's why they live underground."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 4
                        }
                      },
                      "Magical things bring trouble. Never sleep with a magic object within ten feet of you."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 5
                        }
                      },
                      "When you walk through a graveyard, be sure to wear silver, or a ghost might jump into your body."
                    ],
                    [
                      {
                        "type": "cell",
                        "roll": {
                          "exact": 6
                        }
                      },
                      "If an elf looks you in the eyes, she's trying to read your thoughts."
                    ]
                  ]
                }
              ]
            }
          ],
          "source": "XGE",
          "page": 8
        }
      ]
    }
  ],
  "subclass": [
    {
      "name": "Path of the Wizard Slayer",
      "shortName": "Wizard Slayer",
      "source": "FFA",
      "className": "Barbarian",
      "classSource": "FFA",
      "page": 124,
      "subclassFeatures": [
        "Path of the Wizard Slayer|Barbarian|FFA|Wizard Slayer|FFA|3|FFA",
        "Indomitable Soul|Barbarian|FFA|Wizard Slayer|FFA|6|FFA",
        "Destructive Hatred|Barbarian|FFA|Wizard Slayer|FFA|10|FFA",
        "Primordial Scent|Barbarian|FFA|Wizard Slayer|FFA|10|FFA",
        "Disrupting Strike|Barbarian|FFA|Wizard Slayer|FFA|14|FFA"
      ]
    }
  ],
  "classFeature": [
    {
      "name": "Rage",
      "source": "PHB",
      "page": 46,
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 1,
      "entries": [
        "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
        "While raging, you gain the following benefits if you aren't wearing heavy armor:",
        {
          "type": "list",
          "items": [
            "You have advantage on Strength checks and Strength saving throws.",
            "When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.",
            "You have resistance to bludgeoning, piercing, and slashing damage."
          ]
        },
        "If you are able to cast spells, you can't cast them or concentrate on them while raging.",
        "Your rage lasts for 1 minute. It ends early if you are knocked {@condition unconscious} or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
        "Once you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th."
      ]
    },
    {
      "name": "Unarmored Defense",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 1,
      "entries": [
        "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
      ]
    },
    {
      "name": "Danger Sense",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 2,
      "entries": [
        "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be {@condition blinded}, {@condition deafened}, or {@condition incapacitated}."
      ]
    },
    {
      "name": "Reckless Attack",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 2,
      "entries": [
        "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
      ]
    },
    {
      "name": "Primal Knowledge",
      "source": "TCE",
      "page": 24,
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 3,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 3rd-level barbarian {@variantrule optional class features|tce|optional feature}}",
        "When you reach 3rd level and again at 10th level, you gain proficiency in one skill of your choice from the list of skills available to barbarians at 1st level."
      ]
    },
    {
      "name": "Primal Path",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 3,
      "entries": [
        "At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 4,
      "entries": [
        "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Extra Attack",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 5,
      "entries": [
        "Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn."
      ]
    },
    {
      "name": "Fast Movement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 5,
      "entries": [
        "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
      ]
    },
    {
      "name": "Path Feature",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 6,
      "entries": [
        "At 6th level, you gain a feature from your Primal Path."
      ]
    },
    {
      "name": "Feral Instinct",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 7,
      "entries": [
        "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
        "Additionally, if you are surprised at the beginning of combat and aren't {@condition incapacitated}, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
      ]
    },
    {
      "name": "Instinctive Pounce",
      "source": "TCE",
      "page": 24,
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 7,
      "isClassFeatureVariant": true,
      "entries": [
        "{@i 7th-level barbarian {@variantrule optional class features|tce|optional feature}}",
        "As part of the bonus action you take to enter your rage, you can move up to half your speed."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 8,
      "entries": [
        "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Brutal Critical (1 die)",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 9,
      "entries": [
        "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
        "This increases to two additional dice at 13th level and three additional dice at 17th level."
      ]
    },
    {
      "name": "Path feature",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 10,
      "entries": [
        "At 10th level, you gain a feature from your Primal Path."
      ]
    },
    {
      "name": "Relentless Rage",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 11,
      "entries": [
        "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
        "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 12,
      "entries": [
        "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Brutal Critical (2 dice)",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 13,
      "entries": [
        "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack.",
        "This increases to three additional dice at 17th level."
      ]
    },
    {
      "name": "Path feature",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 14,
      "entries": [
        "At 14th level, you gain a feature from your Primal Path."
      ]
    },
    {
      "name": "Persistent Rage",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 15,
      "entries": [
        "Beginning at 15th level, your rage is so fierce that it ends early only if you fall {@condition unconscious} or if you choose to end it."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 16,
      "entries": [
        "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Brutal Critical (3 dice)",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 17,
      "entries": [
        "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
      ]
    },
    {
      "name": "Indomitable Might",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 18,
      "entries": [
        "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
      ]
    },
    {
      "name": "Ability Score Improvement",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 19,
      "entries": [
        "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
        "If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
      ]
    },
    {
      "name": "Primal Champion",
      "source": "PHB",
      "page": 46,
      
      "className": "Barbarian",
      "classSource": "FFA",
      "level": 20,
      "entries": [
        "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
      ]
    }
  ],
  "subclassFeature": [
    {
      "name": "Path of the Wizard Slayer",
      "source": "FFA",
      "page": 124,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 3,
      "entries": [
        "Among certain superstitious tribes, spellcasters and their black magic are perceived as aberrations of nature, responsible for the corruption of the world and the rise of monsters and maladies. The rage of these barbarians primarily goes toward magic users and their minions, particularly those on the side of their enemies. They believe Awakened people are at risk of being possessed by evil entities, and thus they must be disposed of at the slightest hint of deviance, before their accursed powers lead the world into darkness.",
        {
          "type": "refSubclassFeature",
          "subclassFeature": "Spellbreaking Rage|Barbarian|FFA|Wizard Slayer|FFA|3"
        }
      ]
    },
    {
      "name": "Spellbreaking Rage",
      "source": "FFA",
      "page": 125,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 3,
      "header": 1,
      "entries": [
        "Starting when you choose this path at 3rd level, you can channel your rage against magic to repel and disrupt it. When you enter a rage, you can forsake your resistance to bludgeoning, piercing and slashing damage to instead gain resistance to damage of a magical origin(spells, innate spells and powers specifically described as magical). Whether you choose to do this or not, while raging, whenever you deal at least 11 damage with a melee weapon attack against an opponent maintaining concentraion on a spell, the DC of the resulting Constitution saving throw is equal to the total damage instead of half the damage."
      ]
    },
    {
      "name": "Indomitable Soul",
      "source": "FFA",
      "page": 125,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 6,
      "entries": [
        "Beginning at 6th level, while raging, whenever a spell should subject you to one or several conditions, you can use your reaction to immediately cancel the conditions you should have suffered. You can only use this feature once per rage."
      ]
    },
    {
      "name": "Destructive Hatred",
      "source": "FFA",
      "page": 125,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 10,
      "entries": [
        "Starting at 10th level, while raging you have advantage on attack rolls against creatures that have cast a spell (innate or not) or used a power specifically described as magic during their last turn."
      ]
    },
    {
      "name": "Primordial Scent",
      "source": "FFA",
      "page": 125,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 10,
      "entries": [
        "Also at 10th level, you become able to sniff out residual magic and Awakened individuals. This is not a magical ability, and thus, immunity against divination offers no protection against your primordial scent. You can use this feature in three ways:",
        "- As a bonus action, you can designate a creature you can see within 60 feet and immediately know whether it has Awakened and is therefore capable of casting spells. If the creature has Awakened, you have advantage to saving throws against its spells for 10 minutes.",
        "- As an action, you can focus on your environment and detect the presence of Awakened creatures. This does not reveal their identity or their precise location; you just know that at least one Awakened individual is present.",
        "- You can spend 10 minutes studying an area equivalent to a 30-foot-radius sphere. At the end of this investigation, you can ascertain whether a spell (or a power specifically described as magic) has been used in the area within the last 24 hours. A successful DC 20 Wisdom (Insight or Perception) check yields additional information about the most powerful magical effect used during this period in the inspected area. You do not know its name or school of magic, but you learn whether it was used to dominate, charm, blind, teleport, destroy, etc. (at the leader's discretion).",
        "You can use this feature a number of times equal to your proficiency bonus. You regain any expended uses when you finish a long rest."
      ]
    },
    {
      "name": "Disrupting Strike",
      "source": "FFA",
      "page": 125,
      "className": "Barbarian",
      "classSource": "FFA",
      "subclassShortName": "Wizard Slayer",
      "subclassSource": "FFA",
      "level": 14,
      "entries": [
        "Beginning at 14th level, while raging, every time you make a successful melee attack against an Awakened creature, you can disrupt its magical abilities. This renders the creature unable to cast spells or use magical abilities until the start of your next turn. If you use disrupting strike against a creature unable to use magical abilities, nothing happens, but this still expends a use of this feature. You can use this feature a number of times equal to your proficiency bonus. You regain any expended uses when you finish a short or long rest."
      ]
    }
  ]
}